ehughes/rt_super_z/bringup/mk76/mk76_host__bringup_emmc/board/pin_mux.c
    const uint32_t SD_DAT2 = (/* Pin is configured as SD0_D2 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Normal drive */
                              IOPCTL_PIO_FULLDRIVE_DI |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN2 (coords: U11) is configured as SD0_D2 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_DAT2_PORT, BOARD_INITPINS_SD_DAT2_PIN, SD_DAT2);

    const uint32_t SD_DAT3 = (/* Pin is configured as SD0_D3 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Normal mode */
                              IOPCTL_PIO_SLEW_RATE_NORMAL |
                              /* Normal drive */
                              IOPCTL_PIO_FULLDRIVE_DI |
                              /* Analog mux is disabled */
                              IOPCTL_PIO_ANAMUX_DI |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI);
    /* PORT2 PIN3 (coords: T12) is configured as SD0_D3 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_DAT3_PORT, BOARD_INITPINS_SD_DAT3_PIN, SD_DAT3);

    const uint32_t SD_WR_PRT = (/* Pin is configured as PIO2_4 */
                                IOPCTL_PIO_FUNC0 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Normal mode */
                                IOPCTL_PIO_SLEW_RATE_NORMAL |
                                /* Normal drive */
                                IOPCTL_PIO_FULLDRIVE_DI |
                                /* Analog mux is disabled */
                                IOPCTL_PIO_ANAMUX_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI);
    /* PORT2 PIN4 (coords: T13) is configured as PIO2_4 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_WR_PRT_PORT, BOARD_INITPINS_SD_WR_PRT_PIN, SD_WR_PRT);

    const uint32_t SD_CD = (/* Pin is configured as SD0_CARD_DET_N */
                            IOPCTL_PIO_FUNC1 |
                            /* Enable pull-up / pull-down function */
                            IOPCTL_PIO_PUPD_EN |
                            /* Enable pull-up function */
                            IOPCTL_PIO_PULLUP_EN |
                            /* Enables input buffer function */
                            IOPCTL_PIO_INBUF_EN |
                            /* Normal mode */
                            IOPCTL_PIO_SLEW_RATE_NORMAL |
                            /* Normal drive */
                            IOPCTL_PIO_FULLDRIVE_DI |
                            /* Analog mux is disabled */
                            IOPCTL_PIO_ANAMUX_DI |
                            /* Pseudo Output Drain is disabled */
                            IOPCTL_PIO_PSEDRAIN_DI |
                            /* Input function is not inverted */
                            IOPCTL_PIO_INV_DI);
    /* PORT2 PIN9 (coords: R13) is configured as SD0_CARD_DET_N */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITPINS_SD_CD_PORT, BOARD_INITPINS_SD_CD_PIN, SD_CD);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
